// ------------------------------------------------------------------------------------------------ //
// @ file	 : Attribute.h                                                                          //
// @ brief	 : マップチップの属性をもつヘッダファイル                                               //
// @ date	 : 2017/05/09                                                                           //
// @ author  : Madoka Nakajima                                                                      //
// @ note	 :                                                                                      //
// @ version : ver.1.01                                                                             //
// ------------------------------------------------------------------------------------------------ // 
/* 多重インクルードの防止 */
#pragma once
/* 列挙体 */
// ステージの属性
enum MapChipAttribute
{
	// 穴
	HOLE,
	// ネット
	NET,
	// クッキー床
	COOKIE,
	// 数
	ATTRIBUTE_NUM
};
