// ------------------------------------------------------------------------------------------------ //
// @ file	 : Common.h                                                                             //
// @ brief	 : 複数のクラスにまたがる変数をまとめて外部参照するヘッダファイル                       //
// @ date	 : 2017/06/30                                                                           //
// @ author  : Madoka Nakajima                                                                      //
// @ note	 :                                                                                      //
// @ version : ver.3.00                                                                             //
// ------------------------------------------------------------------------------------------------ // 
/* 多重インクルードの防止 */
#pragma once

/* 変数定義 */
extern bool g_mouseFlag;

